#+STARTUP: overview inlineimages logdone noindent

#+include: ~/org/OSX.org::CMakeLists
#+include: ~/org/OSX.org::compile_commands

** Generate =compile_commands.json= using CMAKE
   This is for compiling with the -g flag for debugging. If you are not using ~gdb~, please ignore this part.
   The executable will be compiled in a ~Debug~ directory.
 #+begin_src sh :async
 rm -r CMakeFiles/ Debug/ cmake_install.cmake CMakeCache.txt Makefile compile_commands.json
 # export CXX="/usr/local/opt/llvm/bin/clang++"
 # export CC="/usr/local/opt/llvm/bin/clang"
 cmake -H. -BDebug -DCMAKE_BUILD_TYPE=Debug -DCMAKE_EXPORT_COMPILE_COMMANDS=YES
 ln -s Debug/compile_commands.json
 #+end_src

 #+RESULTS:
 | -- | The         | C     | compiler | identification | is        | AppleClang                                                                                 | 11.0.0.11000033                                       |       |
 | -- | The         | CXX   | compiler | identification | is        | AppleClang                                                                                 | 11.0.0.11000033                                       |       |
 | -- | Check       | for   | working  | C              | compiler: | /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/cc  |                                                       |       |
 | -- | Check       | for   | working  | C              | compiler: | /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/cc  | -                                                     | works |
 | -- | Detecting   | C     | compiler | ABI            | info      |                                                                                            |                                                       |       |
 | -- | Detecting   | C     | compiler | ABI            | info      | -                                                                                          | done                                                  |       |
 | -- | Detecting   | C     | compile  | features       |           |                                                                                            |                                                       |       |
 | -- | Detecting   | C     | compile  | features       | -         | done                                                                                       |                                                       |       |
 | -- | Check       | for   | working  | CXX            | compiler: | /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/c++ |                                                       |       |
 | -- | Check       | for   | working  | CXX            | compiler: | /Applications/Xcode.app/Contents/Developer/Toolchains/XcodeDefault.xctoolchain/usr/bin/c++ | -                                                     | works |
 | -- | Detecting   | CXX   | compiler | ABI            | info      |                                                                                            |                                                       |       |
 | -- | Detecting   | CXX   | compiler | ABI            | info      | -                                                                                          | done                                                  |       |
 | -- | Detecting   | CXX   | compile  | features       |           |                                                                                            |                                                       |       |
 | -- | Detecting   | CXX   | compile  | features       | -         | done                                                                                       |                                                       |       |
 | -- | Configuring | done  |          |                |           |                                                                                            |                                                       |       |
 | -- | Generating  | done  |          |                |           |                                                                                            |                                                       |       |
 | -- | Build       | files | have     | been           | written   | to:                                                                                        | /Users/yunj/Dropbox/research/lsjm-art/lsjm-code/Debug |       |

